<p>
  В цьому уроці ми будемо створювати елемент для вибору року. 
</p>

<p>
  Спочатку зробимо його за допомогою HTML, а потім будемо додавати
  додаткові роки за допомогою JavaScript.
</p>

<p>
  Фінальний результат буде віглядати ось так:
</p>

<?=image('final-result.png', ['alias' => $alias])?>

<h2>Давайте почнемо! Виконуйте урок крок за кроком:</h2>

<ol>
  <li>
    <p>
      Створіть папку з проектом, відкрийте проект за допомогою
      Visual Studio Code, створіть файл index.html та відкрійте
      його в браузері.
    </p>
    <p>
      Якщо ви ніколи такого не робили, то пройдіть спочатку
      <a href="<?=baseUrl()?>lessons/create-simple-html-page" target="_blank">
      цей урок
      </a>.
    </p>
  </li>

  <li>
    <p>
      Вставте цей код між відкриваючим та закриваючим тегами <b>body</b>:
    </p>
    <?=doc('select.html', ['lang' => 'php', 'alias' => $alias])?>

    <p>
      Тепер ваш файл index.html має виглядати якось так:
    </p>
    <?=doc('select-page.html', ['lang' => 'php', 'alias' => $alias])?>

  </li>

  <li>
    <p>
      Збережіть файл та перезавантажте браузер на тій вкладці, де в вас 
      відкрита index.html-сторінка.
    </p>
    <p>
      Ви маєте побачити в браузері елемент з вибором року. За замовчуванням 
      активний рік має значення 2003. За це відповідає атрибут 
      <b>selected</b> для елементу option.
    </p>
  </li>
  <li>
    <h3>
      Тепер давайте додамо ще два елементи option в елемент для вибору року.
</h3>
    <p>
      Це будуть роки 2008 та 2009.
    </p>
    <p>І зробим ми це за допомогою JavaScript.</p>

    <p>
      Вставте цей код перед закриваючим тегом body:
    </p>
    <?=doc('script-part-two-elements.html', ['lang' => 'php', 'alias' => $alias])?>
  
    <p>
      Тепер ваш файл index.html має виглядати якось так:
    </p>
    <?=doc('two-elements-page.html', ['lang' => 'php', 'alias' => $alias])?>
  </li>

  <li>
    <p>
      Подивіться в браузері - тепер в селекті стало на два елемента більше.
    </p>
  </li>

  <li>
    <h3>
      Тепер додамо ще більше елементів в наш селект за допомогою js.
    </h3>

    <p>
      Вставте цей код перед закриваючим тегом <b>script</b>:
    </p>
    <?=doc('script-add-n-elements.js', ['lang' => 'js', 'alias' => $alias])?>
  
    <p>
      Тепер ваш файл index.html має виглядати якось так:
    </p>
    <?=doc('n-elements-page.html', ['lang' => 'php', 'alias' => $alias])?>
  </li>
</ol>

<h2>
  Вітаю! Ви зробили елемент для вибору року та навчились створювати та додавати
  нові елементи за допомогою javascript.
</h2>

