<ol>
  <li>
    <p>
      Достатньо елементарних знать математики.
    </p>
  </li>
  <li>
    <p>
      Програмувати може кожний, навіть той, хто ніколи не бачив комп'ютер.
    </p>
    <p>Тут важлива мотивація та отримання задоволення від процесу.</p>
  </li>
  <li>
    <p>
      Почати програмувати можна в будь-якому віці.
    </p>
  </li>
  <li>
    <p>
      Дуже мало програмістів працюють цілими днями та ночами. 
      Більшість зберігає баланс між роботою та приватним життям.
    </p>
  </li>
  <li>
    <p>
      Новачкам краще вибирати мову програмування під назвою JavaScript, тому що
      програми на javascript можна запускати в браузері.
    </p>
  </li>
  <li>
    <p>
      Недостатньо знати синтаксис для початку програмування.
      Треба ще знати, в чому писати код, як його запускати та,
      найголовніше, розуміти задачу, яку ви вирішуєте.
    </p>
  </li>
  <li>
    <p>
      Програмісти без досвіду роботи заробляють на початку
      своєї кар'єри мало. Це може бути навіть 300, 400 доларів.
      Багато хто на першій своїй роботі працює безкоштовно, 
      щоб отримати цінний досвід.
    </p>
  </li>
  <li>
    <p>
      Можна працювати програмістом, не маючи вищої освіти,
      також не обов'язково закінчувати якісь курси.
    </p>
  </li>
  <li>
    <p>
      Для початку програмування підійде будь-який комп'ютер,
      який може відкривати браузер для сайтів. Так, той самий браузер,
      через який ви заходите в фейсбук:)
    </p>
    <p>
      В такому випадку найкращим варіантом мови програмування 
      буде JavaScript, тому що програми на javascript можна 
      запускати в браузері.
    </p>
  </li>
  <li>
    <p>
      Робота програмістом безпечна для здоров'я.
    </p>
    <p>
      Якщо робити перерви під час робочого дня та робити фізичні
      вправи хоча б раз на день, то роботу програмістом можна 
      вважати найбільш безпечною роботою в світі.
    </p>
  </li>
  <li>
    <p>
      Покращувати навички програмування можна протягом всього життя.
      Це як вміння малювати - гарні митці вчаться все життя.
    </p>
  </li>
  <li>
    <p>
      Програмісти сидять за комп'ютером рівно стільки, скільки хочуть.
    </p>
    <p>
      Ніхто не має права змушувати вас сидіти перед монітором весь день.
    </p>
  </li>
  <li>
    <p>
      Стати програмістом можна самостійно. Вам не обов'язково
      закінчувати якісь курси або мати ментора (вчителя).
    </p>
    <p>
      В інтернеті багато безкоштовного матеріалу для вивчення програмування.
    </p>
  </li>
  <li>
    <p>
      Щоб відгукнутися на вакансію, не обов'язково відповідати усім
      вимогам, які в ній вказані.
    </p>
    <p>
      Достатньо відповідати основним вимогам.
      Все інше можна вивчити в процесі роботи.
    </p>
  </li>
  <li>
    <p>
      Програмістів багато не буває. У зв'язку з тим, що
      світ стає більш технологічним, сучасним компаніям завжди
      потрібні програмісти.
    </p>
  </li>
  <li>
    <p>
      Штучний інтелект не замінить програмістів, а буде їм
      тільки допомагати. Зрештою, програму штучного інтелекту
      хтось має писати та підтримувати:)
    </p>
  </li>
  <li>
    <p>
      Мову програмування треба не вивчати, а використовувати вже 
      з першого дня, користуючись прийомами та синтаксисом мови.
    </p>
  </li>
  <li>
    <p>
      Не треба шукати найшвидшу мову програмування. Для 
      першої мови підійде будь-яка.
    </p>
    <p>
      В нашій академії вважається , що найбільш вдалим
      вибором для першої мови буде JavaScript. 
      Програми на JavaScript можна запускати прямо в браузері,
      тому ви можете почати програмувати вже з першого дня.
    </p>
  </li>
</ol>
